{"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "sparse": false, "name": "Input"}, "name": "Input", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "DownConv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "DownConv1", "inbound_nodes": [[["Input", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "DownSample1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "DownSample1", "inbound_nodes": [[["DownConv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "DownConv2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "DownConv2", "inbound_nodes": [[["DownSample1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "DownSample2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "DownSample2", "inbound_nodes": [[["DownConv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "DownConv3", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "DownConv3", "inbound_nodes": [[["DownSample2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "DownSample3", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "DownSample3", "inbound_nodes": [[["DownConv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "DownConv4", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "DownConv4", "inbound_nodes": [[["DownSample3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "DownSample4", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "DownSample4", "inbound_nodes": [[["DownConv4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "DownConv5", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "DownConv5", "inbound_nodes": [[["DownSample4", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "DownSample5", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "DownSample5", "inbound_nodes": [[["DownConv5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "UpConv5", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "UpConv5", "inbound_nodes": [[["DownSample5", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "UpSample5", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "UpSample5", "inbound_nodes": [[["UpConv5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "UpConv4", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "UpConv4", "inbound_nodes": [[["UpSample5", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "UpSample4", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "UpSample4", "inbound_nodes": [[["UpConv4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "UpConv3", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "UpConv3", "inbound_nodes": [[["UpSample4", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "UpSample3", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "UpSample3", "inbound_nodes": [[["UpConv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "UpConv2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "UpConv2", "inbound_nodes": [[["UpSample3", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "UpSample2", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "UpSample2", "inbound_nodes": [[["UpConv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "UpConv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "UpConv1", "inbound_nodes": [[["UpSample2", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "UpSample1", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "UpSample1", "inbound_nodes": [[["UpConv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Output", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Output", "inbound_nodes": [[["UpSample1", 0, 0, {}]]]}], "input_layers": [["Input", 0, 0]], "output_layers": [["Output", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}